---
kind: property
id: P:Autodesk.Revit.DB.Electrical.CableTraySettings.RiseDropAnnotationSize
source: html/e48da85b-1c77-b4d5-d78c-925f46d5b7d7.htm
---
# Autodesk.Revit.DB.Electrical.CableTraySettings.RiseDropAnnotationSize Property

The rise drop annotation size.

## Syntax (C#)
```csharp
public double RiseDropAnnotationSize { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentOutOfRangeException** - When setting this property: The given value for riseDropAnnotationSize must be between 0 and 30000 feet.